Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/widowed_persons_bereavement_grant.html.txt.tmx
Source language: en
Languages: ga

source: Widowed or Surviving Civil Partner Grant
ga: Deontas Baintreachais nó Páirtnéara Shibhialta Mharthanaigh

source: The Widowed or Surviving Civil Partner Grant is a once-off payment to widows, widowers or surviving civil partners with dependent children
ga: Is íocaíocht glan é an Deontas Baintreachais nó Páirtnéara Shibhialta Mharthanaigh seo a thugtar do bhaintrí , baintrí fir nó páirtnéirí sibhialta marthanacha a bhfuil páistí cleithiúnacha acu

source: This grant is available to widows, widowers or surviving civil partners who have one or more dependent children living with them at the date of death, or a widow or surviving civil partner whose child is born within 10 months of the date of death of her spouse or civil partner
ga: Níl an deontas seo ar fáil ach do bhaintrí, baintrí fir nó páirtnéirí sibhialta marthanacha a bhfuil páiste cleithiúnach amháin nó níos mó ag maireachtáil in éineacht leo nó a saolaítear a leanbh laistigh de 10 mí o dha ta báis a céile nó páirtnéir sibhialta

source: You must also qualify for one of the following payments:
ga: Caithfidh tú bheith i dteideal ceann de na híocaíochtaí seo a leanas:

source: • Widow's, Widower's or Surviving Civil Partner’s Contributory Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach),

source: • Bereavement Grant payable on the death of your spouse
ga: • Deontas Báis iníoctha ar bhás a gcéile nó a bpáirtnéir sibhialta

source: • Death Benefit under the Occupational Injuries Scheme
ga: • Sochar Báis faoin Scéim Gortuithe Ceirde

source: • A Widow's, Widower's or Surviving Civil Partner’s Contributory Pension from another EU state or a country with which Ireland has a bilateral social security agreement
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) ó Bhallstáit eile de chuid an AE nó ó thír lena bhfuil aontú déthaobhach slándála sóisialta ag Éire

source: This grant is a once-off payment of €6,000
ga: Is íocaíocht in aon chuid amháin é an deontas seo, agus suim de €6000 a bhíonn i gceist

source: Payment of the Widowed or Surviving Civil Partner Grant is made by cheque, payable to the widow, widower or surviving civil partner
ga: Íoctar an Deontas Baintreachais nó Páirtnéara Shibhialta Mharthanaigh tríd sheic, iníoctha leis an baintreach, baintreach fir nó páirtnéir sibhialta

source: This is issued immediately following the decision of the Deciding Officer on one of the above payments
ga: Beidh sé eisithe gan moill tar éis cinnidh Oifigigh Cinnidh i gcomhair ceann de na híocaíochtaí thuas

source: Download Form WPG 1 here (pdf)
ga: Ba chóir duit an fhoirm iarratais WPG 1 (pdf) a íoslódáil anseo

source: Widow's, Widower's or Surviving Civil Partner's Pension Section
ga: Rannóg an Phinsin Baintrí/Baintreach Fir nó Páirtnéir Sibhialta Mharthanaigh

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: You can email an enquiry about the Widowed or Surviving Civil Partner Grant using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Deontas Tuismitheora Baintrí a sheoladh tríd an fhoirm fhiosraithe a úsáid

source: If you wish to talk to someone face-to-face about your pension entitlements, you can visit your local Citizens Information centre, social welfare local office or Intreo centre
ga: Más mian leat labhairt duine-le-duine faoi do theidlíochtaí, is féidir leat cuairt a thabhairt ar d'ionad Faisnéise do Shaoránaigh áitiúil, oifig leasa shóisialaigh áitiúil nó ionad Intreo
